# Make sure we’re using the latest Homebrew
#brew 'update'
#brew 'doctor'

# Upgrade any already-installed formulae
#brew 'upgrade'

# tap's 
#tap 'homebrew/cask'
tap 'homebrew/bundle'
#tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'

#Formulaes to be installed
brew 'mas' # Mac AppStore
brew 'neovim' # Neovim
brew 'node' # Node
brew 'n' # Node Version Manager
brew 'cmake'
brew 'ripgrep'
brew 'diff-so-fancy'
brew 'imagemagick'
brew 'mkcert'
brew 'nss'
brew 'openssl@1.1'
brew 'git'
brew 'starship'
brew 'exa'
brew 'bat'
cask 'font-iosevka-term-nerd-font'
cask 'font-iosevka-nerd-font'

#
# # Remove outdated versions from the cellar
# cleanup

# Mac AppStore apps
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541 
mas 'Tweetbot', id: 557168941
mas 'Numbers', id: 409203825
mas 'Xcode', id: 497799835
mas 'Consent-O-Matic', id: 1606897889

# swiftlint depends on xcode to be installed
brew 'swiftlint'

# Adnami specific
brew 'azure-cli'
cask 'dotnet-sdk'
cask 'powershell'

# GUI apps
cask 'firefox'
cask 'google-chrome'
cask 'brave-browser'
cask 'opera'
cask 'sizzy'

cask 'discord'
cask 'slack'
cask 'signal'
cask 'zoom'

cask 'rectangle'
cask 'choosy'
cask 'protonmail-bridge'
cask 'spotify'
cask 'netnewswire'
#cask 'megasync'
cask 'zsa-wally'
cask 'graphiql'
#cask 'gpg-suite'
cask 'affinity-designer'
cask 'affinity-photo'
cask 'affinity-publisher'
cask 'visual-studio-code'
cask 'epic-games'
cask 'warp'

cask 'lulu'
cask 'knockknock'
cask 'oversight'
