# Make sure we’re using the latest Homebrew
#brew 'update'
#brew 'doctor'

# Upgrade any already-installed formulae
#brew 'upgrade'

# tap's 
tap 'homebrew/cask'
tap 'homebrew/bundle'

#Formulaes to be installed
brew 'mas'
brew 'vim'
brew 'node'
brew 'cmake'
brew 'ripgrep'
brew 'diff-so-fancy'
brew 'imagemagick'
brew 'swiftlint'
brew 'mkcert'
brew 'nss'
#
# # Remove outdated versions from the cellar
# cleanup

# Mac AppStore apps


# GUI apps
cask 'firefox'
cask 'google-chrome'
cask 'brave-browser'
cask 'opera'

cask 'discord'
cask 'skype'
cask 'signal'
cask 'zoom'

cask 'rectangle'
cask 'choosy'
cask 'protonmail-bridge'
cask 'spotify'

cask 'lulu'
cask 'knockknock'
cask 'oversight'
