# Make sure we’re using the latest Homebrew
#brew 'update'
#brew 'doctor'

# Upgrade any already-installed formulae
#brew 'upgrade'

# tap's 
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'

#Formulaes to be installed
brew 'mas'
brew 'vim'
brew 'node'
brew 'cmake'
brew 'ripgrep'
brew 'diff-so-fancy'
brew 'imagemagick'
brew 'mkcert'
brew 'nss'
brew 'openssl@1.1'
brew 'git'
brew 'starship'
#
# # Remove outdated versions from the cellar
# cleanup

# Mac AppStore apps
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541 
mas 'Tweetbot', id: 557168941
mas 'Numbers', id: 409203825
mas 'Xcode', id: 497799835
# swiftlint depends on xcode to be installed
brew 'swiftlint'

# GUI apps
cask 'firefox'
cask 'google-chrome'
cask 'brave-browser'
cask 'opera'

cask 'discord'
cask 'skype'
cask 'signal'
cask 'zoom'

cask 'rectangle'
cask 'choosy'
cask 'protonmail-bridge'
cask 'spotify'
cask 'megasync'
cask 'zsa-wally'
cask 'graphiql'
cask 'gpg-suite'

cask 'lulu'
cask 'knockknock'
cask 'oversight'
